{
  "project1": {
    "id": 1,
    "name": "Nomi Movies",
    "location": {
      "name": "BCIT",
      "ref": "https://www.bcit.ca/programs/front-end-web-developer-certificate-full-time-6535cert/"
    },
    "techTitles": "NextJS, SCSS, Supabase, NextAuth",
    "introText": "This project was done in groups of 4 in the BCIT Front-End Developer program with the goal being to create a movie database that could save a users favorites and display movies from the TMDB API. My group chose to use NextJS and include a database hosted on Supabase to store our favorites instead of using local browser storage. I chose to use a database because then you would be able to sync favorites across multiple devices and not just save them locally.",
    "image": "../projects/moviedb/home.png",
    "github": "https://github.com/JedBorseth/movie-database",
    "learned": {
      "0": {
        "title": "Coding in a team",
        "video": "../projects/moviedb/screen-record.webm",
        "videoApple": "../projects/moviedb/screen-record.mp4",
        "content": "This project showcases my skills using industry standard workflows such as Scrum and Waterfall methodologies as well as using tools like Trello or Jira.  Further, through my work on this I was able to demonstrate both leading and working with a team to create a superior product beyond the outlined project scope and expectations."
      }
    }
  },
  "project2": {
    "id": 2,
    "name": "3D Gallery",
    "location": {
      "name": "Personal Project",
      "ref": ""
    },
    "techTitles": "Three.JS, Vite, Typescript",
    "introText": "You know how you go to a website and it is boring, band, and unoriginal. Part of the reason I love coding is because it gives me the opportunity to be creative and make well written, user friendly websites. I created this project to illustrate three.js just to be creative and try something different. Some sites that inspired me are: ",
    "image": "../projects/threejs-portfolio/home.png",
    "github": "https://github.com/JedBorseth/threejs-gallery",
    "learned": {
      "0": {
        "title": "Learning New Things",
        "video": "../projects/threejs-portfolio/screen-record.webm",
        "videoApple": "../projects/threejs-portfolio/screen-record.mp4",
        "content": "It was so cool to step outside of my comfort zone and incorporate lighting and shape geometry into my web development skill set.  I have a new level of appreciation for game developers and 3D model designers. I enjoyed learning something new through this project and it has prepared me to program inside of a 3D scene."
      }
    }
  }
}
